# iMPORT PANDAS BEFORE GETTING STARTED

In [1]:
#Import packages pandas packages
import pandas as pd

# creating dataframe from dictionary sequence

In [4]:
UR_Web_Visit = {
    'Day':[1,2,3,4,5,6],
    'Visitors':[2000,1500,5000,2000,900,750],
    'Bounce Rate':[30,30,28,21,15,38]
}

#convergt dictionary into pandas dataframe and store into df variable
df = pd.DataFrame(UR_Web_Visit)

#print df (df is a dataframe variable)
df

   Day  Visitors  Bounce Rate
0    1      2000           30
1    2      1500           30
2    3      5000           28
3    4      2000           21
4    5       900           15
5    6       750           38

In [12]:
# Reading csv external file using pandas
product_df=pd.read_csv('datasets/product.csv')
#printing product_df data frame
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

# Slicing first two rows

In [6]:
# To print first-two element we use head function and pass 2 as an argument
#If you want to print more/less rows, you can increase/decrease argument value
# If you dont provide an argument in head() function. It prints first-five rows by default
df.head(2)

   Day  Visitors  Bounce Rate
0    1      2000           30
1    2      1500           30

# Slicing last two rows

In [7]:
# To print first-two element we use tail function and pass 2 as an argument
#If you want to print more/less rows, you can increase/decrease argument value
# If you dont provide an argument in tail() function. It prints last-five rows by default
df.tail(2)

   Day  Visitors  Bounce Rate
4    5       900           15
5    6       750           38

In [10]:
df.sample(3)

   Day  Visitors  Bounce Rate
3    4      2000           21
2    3      5000           28
0    1      2000           30

In [ ]:
import statistics as sts
usr=df.Visitors
print(usr)
m=sts.median(usr)
print(m)

# merge dataframe

In [16]:
# Reading csv external file using pandas
product_df=pd.read_csv('datasets/product.csv')
#printing product_df data frame
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

In [17]:
# Reading csv external file using pandas
customer_df=pd.read_csv('datasets/customer.csv')
#printing product_df data frame
customer_df

   ID     Name  Age  Product_ID Purchased_Product       City
0   1   Olivia   20         101             Watch     Mumbai
1   2   Aditya   25           0                Na      Delhi
2   3     Cory   15         106               Oil  Bangalore
3   4  Isabell   10           0               NaN    Chennai
4   5  Dominic   30         103             Shoes    Chennai
5   6    Tyler   65         104        Smartphone      Delhi
6   7   Samuel   35           0               NaN    Kolkata
7   8   Daniel   18           0               NaN      Delhi
8   9   Jeremy   23         107            Laptop     Mumbai

In [21]:
#Inner merge
pd.merge(product_df,customer_df,how='inner', on='Product_ID')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [20]:
pd.merge(product_df,customer_df,how='inner',left_on='Product_Name',right_on='Purchased_Product')

,Product_ID_x,Product_Name,Category,Price,Seller_City,ID,Name,Age,Product_ID_y,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,101,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,103,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,104,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,106,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,107,Laptop,Mumbai

In [22]:
pd.merge(product_df,customer_df,how='inner',
         left_on=['Product_ID','Seller_City'],
         right_on=['Product_ID','City'])

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai

# Full merge

In [23]:
pd.merge(product_df,customer_df,on='Product_ID',how='outer')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi

In [24]:
pd.merge(product_df,customer_df,on='Product_ID',how='outer',indicator=True)

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City,_merge
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai,both
1,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN,left_only
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai,both
3,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi,both
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN,left_only
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore,both
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai,both
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi,right_only
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai,right_only
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata,right_only
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi,right_only

# Left Merge

In [25]:
#Left Merge
pd.merge(product_df,customer_df,on='Product_ID',how='left')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

# Right Merge

In [37]:
pd.merge(product_df,customer_df,on='Product_ID',how='right',sort=True, indicator=True)

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City,_merge
0,0,NaN,NaN,NaN,NaN,2,Aditya,25,Na,Delhi,right_only
1,0,NaN,NaN,NaN,NaN,4,Isabell,10,NaN,Chennai,right_only
2,0,NaN,NaN,NaN,NaN,7,Samuel,35,NaN,Kolkata,right_only
3,0,NaN,NaN,NaN,NaN,8,Daniel,18,NaN,Delhi,right_only
4,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai,both
5,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai,both
6,104,Smartphone,Electronics,14999.0,Klokata,6,Tyler,65,Smartphone,Delhi,both
7,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore,both
8,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai,both

# Handling Redundancy/Duplicates in Merge

In [49]:
"""Reading product_details_with_duplicate_data.csv file 
which is having duplicates data"""

product_duplicate=pd.read_csv('datasets/product_details_with_duplicate_data.csv')
product_duplicate

   Product_ID Product_name     Category    Price Seller_City
0       101.0        Watch      Fashion    299.0       Delhi
1       102.0          Bag      Fashion   1350.5      Mumbai
2       103.0        Shoes      Fashion   2999.0     Chennai
3       104.0   Smartphone  Electronics  14999.0     Kolkata
4       105.0        Books        Study    145.0       Delhi
5       106.0          Oil      Grocery    110.0     Chennai
6       107.0       Laptop  Electronics  79999.0   Bengalore
7         NaN          NaN          NaN      NaN         NaN

In [41]:
product_duplicate.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [46]:
#drop duplicates in dataset before merge
pd.merge(product_duplicate.drop_duplicates(),customer_df,how='inner',on='Product_ID')

,Product_ID,Product_name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [51]:
#use validator in merege
pd.merge(product_duplicate,customer_df,how='inner',on='Product_ID', validate='many_to_many')

,Product_ID,Product_name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101.0,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103.0,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104.0,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106.0,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107.0,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai